In [29]:
import pandas as pd 
import numpy as np
from pandas import DataFrame

In [31]:
DataFrame() 
pandas.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [3]:
pd.read_csv("test_text.txt", sep="|") #디폴트 행 인덱스 : 0번~
pd.read_csv("test_text.txt", sep="|", index_col='ID') #ID값이 '행 인덱스'로 옴
pd.read_csv("test_text.txt", sep="|", index_col=0)  # 인덱스 번호로도 가능

   LAST_NAME  AGE
ID
1        KIM   25
2        LEE   22
3       PARK   33
4       CHOI   24
5        CHO   30

In [6]:
pd.read_csv("test_text_withoutname.txt",header=None, sep="|", index_col=0)  #header가 있음 , default설정되있음

      1   2
0
1   KIM  25
2   LEE  22
3  PARK  33
4  CHOI  24
5   CHO  30

In [10]:
pd.read_csv("test_text.txt", sep="|",skiprows=2)  #연속적으로 여러줄을 스킵할 경우
pd.read_csv("test_text.txt", sep="|",skiprows=[0,2])  #비연속적으로 여러줄을 스킵할 경우

   1   KIM  25
0  3  PARK  33
1  4  CHOI  24
2  5   CHO  30

In [12]:
pd.read_csv("test_text.txt", sep="|",nrows=2) #2줄만 불러오기

   ID LAST_NAME  AGE
0   1       KIM   25
1   2       LEE   22

In [17]:
data=pd.read_csv("test_text_na.txt", sep="|",nrows=3) 
data.info()  #데이터프레임 정보 보기  #object-문자

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
ID           3 non-null int64
LAST_NAME    3 non-null object
AGE          3 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [19]:
data=pd.read_csv("test_text_na.txt", sep="|")
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  없음
2   3      PARK  33
3   4        모름  24
4   5       CHO  30

## 지정 문자를 결측값(NA) 처리 : na_values

In [21]:
#결측값(NA)==NAN
data=pd.read_csv("test_text_na.txt", sep="|", na_values=["없음","모름"]) #"없음"이라는 문자에 대해 결측값 처리
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    4 non-null object
AGE          4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

   ID LAST_NAME   AGE
0   1       KIM  25.0
1   2       LEE   NaN
2   3      PARK  33.0
3   4       NaN  24.0
4   5       CHO  30.0

## 데이터 타입 지정 : dtype

In [23]:
#데이터 타입 지정
data=pd.read_csv("test_text_na.txt", sep="|",dtype={'ID':int,'LAST_NAME':str,'AGE':str}) 
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int32
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int32(1), object(2)
memory usage: 228.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  없음
2   3      PARK  33
3   4        모름  24
4   5       CHO  30

## to_csv함수

In [33]:
#DataFrame.to_csv함수: 데이터 프레임을 csv로 저장
from pandas import DataFrame

#딕셔너리 데이터로 데이터프레임 생성  #자동 행 인덱스(0번부터~)
df=DataFrame({
    'id':['a1','a2','a3','a4','a5'], 
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
})
df

   id  x1   x2
0  a1   1  1.1
1  a2   2  2.2
2  a3   3  3.3
3  a4   4  4.4
4  a5   5  5.5

In [34]:
#행 인덱스 지정 (a번부터~e번)
#총 인수 2개
df=DataFrame({
    'id':['a1','a2','a3','a4','a5'], 
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
}, index=['a','b','c','d','e']) 
df

   id  x1   x2
a  a1   1  1.1
b  a2   2  2.2
c  a3   3  3.3
d  a4   4  4.4
e  a5   5  5.5

In [37]:
#새로운 행 인덱스 추가
df2=df.reindex(['a','b','c','d','e','f'])
df2

#새로운 행 인덱스를 삭제하거나 추가하면 
#해당 인덱스가 삭제, 새로운 인덱스는 결측값으로 출력
df3=df.reindex(['a','c','e','f'])
df3

    id   x1   x2
a   a1  1.0  1.1
c   a3  3.0  3.3
e   a5  5.0  5.5
f  NaN  NaN  NaN

In [38]:
df2.to_csv("df2.csv")  #to_csv함수로 저장된 csv는 "," 로 자동 구분됨

In [39]:
df2.to_csv("df3.csv",sep="$")

In [44]:
df2.to_csv("df4.csv", na_rep="NaN",float_format="%.2f") #소수이하 둘째자리 까지 출력

In [47]:
df2.to_csv("df5.csv", na_rep="NaN", columns=["id","x2"]) #원하는 열(id,x2) 지정

In [48]:
df2.to_csv("df5.csv", na_rep="NaN", columns=["id","x2"], index=False) #행 인덱스 출력 안함

In [49]:
from pandas import DataFrame as df #pandas로 부터 DataFrame을 import하여 df으로 이름 지정

In [64]:
np.arange(8)   #numpy에서 array(배열)생성

np.arange(8).reshape(2,4) #2행 4열의 2차원 배열 재생성

np.arange(8).reshape(2,2,2) #깊이=요소갯수

df1=df(data=np.arange(8).reshape(4,2), columns=["col0","col1"], index=['row0','row1','row2','row3']) #행과 열 인덱스 지정
df1

      col0  col1
row0     0     1
row1     2     3
row2     4     5
row3     6     7

In [ ]:
#transpose matrix : 전치 행렬(행과 열을 바꿈)

In [67]:
df1.T
df1

      col0  col1
row0     0     1
row1     2     3
row2     4     5
row3     6     7

In [68]:
df1.axes         #axis(축,단수), axes(복수) : 행과 열에 대한 정보 출력

[Index(['row0', 'row1', 'row2', 'row3'], dtype='object'),
 Index(['col0', 'col1'], dtype='object')]

In [73]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row0 to row3
Data columns (total 2 columns):
col0    4 non-null int32
col1    4 non-null int32
dtypes: int32(2)
memory usage: 224.0+ bytes

In [76]:
df1.shape[0]

4

In [77]:
df1.size #df1의 요소값 크기

8

In [78]:
df1.values #df1의 요소값

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [86]:
np.random.randn(5) #난수 생성

array([ 0.20959817, -0.13705424,  0.17151457,  0.12657073, -0.16003652])

In [89]:
df=DataFrame({"cls_1":['a','a','b','b','c'],"v1":np.arange(5),"v2":np.random.randn(5)}, index=['r0','r1','r2','r3','r4'])
df.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [94]:
df

   cls_1  v1        v2
r0     a   0  0.657285
r1     a   1 -1.376566
r2     b   2  1.808805
r3     b   3  0.864180
r4     c   4  2.024467

In [100]:
#ix : 행 단위로 indexing할때 '행 위치(정수)'와 '행 인덱스 이름'을 모두 사용할 수 있다.

import warnings
warnings.filterwarnings(action="ignore")   #warnings(경고메세지)에 대해 속성(action)값 : ignore

df.ix[2]  #2번 인덱스의 행 추출
df.ix['r2'] # 'r2'라는 인덱스의 행 추출


df.ix[3:]
df.ix['r3':] #둘다 모두 가능

   cls_1  v1        v2
r3     b   3  0.864180
r4     c   4  2.024467

In [102]:
df.head(3)
df.tail(3)

   cls_1  v1        v2
r2     b   2  1.808805
r3     b   3  0.864180
r4     c   4  2.024467

In [103]:
df

   cls_1  v1        v2
r0     a   0  0.657285
r1     a   1 -1.376566
r2     b   2  1.808805
r3     b   3  0.864180
r4     c   4  2.024467

In [107]:
df["cls_1"] 
df[["cls_1","v1","v2"]] #1개 이상일 경우 대괄호 2개 ** #type: DataFrame

   cls_1  v1        v2
r0     a   0  0.657285
r1     a   1 -1.376566
r2     b   2  1.808805
r3     b   3  0.864180
r4     c   4  2.024467

In [109]:
type(df["cls_1"]) #type: series
df["cls_1"]

r0    a
r1    a
r2    b
r3    b
r4    c
Name: cls_1, dtype: object

In [118]:
df=DataFrame({"cls_1":['a','a','b','b','c'],"v1":np.arange(5),"v2":np.random.randn(5)}, index=['r0','r1','r2','r3','r4'])

df.reindex(['r0','r1','r2','r5','r6'])

   cls_1   v1        v2
r0     a  0.0  0.801164
r1     a  1.0  0.738106
r2     b  2.0 -1.053668
r5   NaN  NaN       NaN
r6   NaN  NaN       NaN

In [120]:
df.reindex(['r0','r1','r2','r5','r6'],fill_value=0) #새 인덱스 값을 NaN이 아닌 0으로 채우기
df.reindex(['r0','r1','r2','r5','r6'],fill_value="NA") #새 인덱스 값을 NaN이 아닌 결측값으로 채우기

   cls_1  v1        v2
r0     a   0  0.801164
r1     a   1  0.738106
r2     b   2  -1.05367
r5    NA  NA        NA
r6    NA  NA        NA

## 시계열 데이터(data_range함수)

In [122]:
#시계열 데이터: data_range함수=> DataFrame에서 index를 만들때 
pd.date_range("1/7/2020", periods=5) #1/7/2020 부터 데이터 5개 출력 #dtype=datatime64[ns] #일 (Date)단위로 출력 #기본값:Date

DatetimeIndex(['2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-11'],
              dtype='datetime64[ns]', freq='D')

In [125]:
date_idx=pd.date_range("1/7/2020", periods=5, freq="D") # 월(Month)단위로 출력

In [128]:
df2=pd.DataFrame({"c1":[5,3,7,6,4]})
df2

   c1
0   5
1   3
2   7
3   6
4   4

In [129]:
df2=pd.DataFrame({"c1":[5,3,7,6,4]},index=date_idx) #date_index: 행 인덱스를 날짜로 주기(오늘부터)
df2

            c1
2020-01-07   5
2020-01-08   3
2020-01-09   7
2020-01-10   6
2020-01-11   4

In [138]:
data_idx2=pd.date_range("1/1/2020", periods=20, freq="D")

#df3=pd.DataFrame({"c1":[5,3,7,6,4]},index=date_idx2)
df2.reindex(data_idx2, method="ffill") 
df2.reindex(data_idx2, method="bfill")

             c1
2020-01-01  5.0
2020-01-02  5.0
2020-01-03  5.0
2020-01-04  5.0
2020-01-05  5.0
2020-01-06  5.0
2020-01-07  5.0
2020-01-08  3.0
2020-01-09  7.0
2020-01-10  6.0
2020-01-11  4.0
2020-01-12  NaN
2020-01-13  NaN
2020-01-14  NaN
2020-01-15  NaN
2020-01-16  NaN
2020-01-17  NaN
2020-01-18  NaN
2020-01-19  NaN
2020-01-20  NaN